<template lang="md">
## Основная информация
**Secrets of anderia** - проект, который разрабатывался инди разработчиком [Артуром Хазеевым ( псевд. Geek Man )](geek-man) из ассета графики на Construct 2 в 2021 году. Затем эта игра переросла в метроидванию, а после перетерпела множество переработок и перенос на Construct 3 и другие движки.

## Сюжет
В игре изначально не был предусмотрен сюжет на ранних этапах разработки, всё время тратилось на механики, геймдизайн и оптимизацию и поэтому он не был сформирован.

## Стримы
Периодически [на ютуб канале разработчика](https://www.youtube.com/@GeekManOff) происходила разработка игры в реальном времени, часто именно там генерировались новые мемы по игре.

## Статус разработки игры

Вот что говорит разработчик о статусе разработки игры:
> На данный момент игра заморожена и её репозиторий приватен.
Недавно обсуждались планы о разморозке и переработке проекта в том числе полный отказ от графики из ассета, но диалог так и не был доведён до конца и проект по сей момент остаётся замороженным.
-- [Geek Man](geek-man) при мини-интервью с [DiabloSat](geek-man)


</template>
<script>
export default {
    name: "anderia",
    layout: "articleLayout"
}
</script>
<style scoped lang="scss">

</style>
<style>
  html, body{
    overflow-y: scroll;
  }
</style>